import random
#library
professions = ["Преподаватель","Полицейский","Пожарный","Психолог","Сексолог","Хирург","Медик","Строитель","Воспитатель","Инжинер","Сантехник","Электрик","Фармацефт","Вирусолог","Военный","Военный Лётчик","Президент","Дипломат","Химик","Биолог","Агроном","Астроном","Диджей","Ветеренар","Безработный","Бармен","Дворник","Официант","Повар","Программист","Флорист","Кассир","Секретарь","Плотник","Детектив","Блоггер","Татуировщик","Художник","Музыкант","Математик","Кинолог","Режиссёр","Сомелье","СММщик","Диктор","Фокусник","Клоун","Сисадмин","Косплеер","Грабитель","Банкир","Реелтор","Рыбак","Водолоз","Писатель","Охранник","Священник","Стриптизёр","Географ","Порноактёр","Парикмахер","Физик"]
healthStates = ["ВИЧ","Авитаминоз","Алкоголизм","Аллергия на шерсть","Алергия на пыльцу","Анорексия","Астма","Бессонница","Биполярочка","Болезнь Альцгеймера","Оспа","Гастрит","Гемофилия","Глаукома","Дальтонизм","Депрессия","Заикание","Косоглазие","Кариес","Проблемы со зрением","Наркомания","Недержание мочи","Диарея","Алкоголизм","Ожирение","Плоскостопия","Псориаз","Параноя","Рак крови","Рак лёгких","Рак мозга","Туберклёз","Синдром Туретта","Астма","COVID-19","Травма руки","Травма ноги","Остеохондроз","Мигрень","Бесплодие","Грипп","Геморрой","Беременность",]
bioFeatures = ["Разумный андроид","Высокий рост","Низкий рост","Карлик","",]
hobbies = ["Рисование","Писательство","Программирование","Вышивание","Увлекается скрапбукингом","Танцы","Астрология","Картография","Увлекается Биологией","Увлекается Физикой","Увелекается Математикой","Увлекается садоводством","Изкотовление кукол","Шутки","Бег","Азартные игры","Увлекается готовкой","Стрельба из лука","Стрельба из оружия","Разработка сайтов","Разводить животных","Плаванье","Онанизм","Автомобили","Боевые искусства","Боулинг","Граффити","Дизайн интерьеров","Дизайн одежды","Игра на музыкальных инструментах","Кроссворды","Оригами","Паркур","Охота","Программирование","Путешествия","Скейдборд","Страйкбол","Пчеловодство","Чтение книг"]
phobias = ["Боязнь клоунов","Боязнь пауков","Боязнь смерти","Боязнь пришельцев","Боязнь дьявола","Боязнь грызунов","Боязнь собак","Боязнь высоты","Боязнь замкнутого пространства","Боязнь открытого пространства","Боязнь страха","Боязнь глубины","Боязнь острых предметов","Боязнь компьютеров","Боязнь детей","Боязнь теменоты","Боязнь призраков","Боязнь массового скопления людей","Боязнь противоположного пола","Боязнь громких звуков","Боязнь солнечного света","Боязнь цветов","Боязнь докторов","Боязнь транспорта и вождения","Боязнь кошек","Боязнь сексуальных домогательств","Боязнь насекомых","Боязнь грома","Боязнь говорить","Боязнь боли","Боязнь нового","Боязнь оружия"]
additionalInfos = ["Создатель рекламы дары Кубани","Снимался в рекламе шампуня Джумайсынба","Был(а) вожатым в лагере","Ведёт личный дневник","Верит в инопланетян","Занял(а) первое место на марафоне","Знает наизусть все стихи Пушкина","Знает четыре языка","Играл(а) в театре","Любит мягкие игрушки","Имеет два высших образования","Ненавидит кофе","Ненавидит современную музыку","Не переносит алкоголь","Обладает феноменальной памятью","Пережил(а) покушение убийцы","Побывал(а) на вершине эвереста","Продал(а) почку","Сидел(а) в тюрьме","Спас(ла) утопающего","Прошёл(ла) курсы сексолога","Прошёл(ла) курсы психолога","Прошёл(ла) курсы парикмахера","Страдает морской болезнью","Является вегетерианцем","Является копрофилом","Является мастером спорта по боксу","Умеет вскрывать замки","Хорошо ладит с животными","Умеет оказывать первую помощь","Проектировал(а) этот бункер","Уверен(а) что катастрофа - заговор иллюминатов","Прошёл(ла) курсы первой помощи"]
bagages = ["Атомобильная аптечка x2","Беспроводная колонка","Бутылка коньяка","Газовая горлка","Гитара","Грудной ребёнок","Губная гормошка","Дедовское Ружьё и небольшая коробка патронов","Гражданский противогаз и 2 запасных фильтра","10 одноразовых медицинских масок","Книга по выживанию","Дублёнка","Зажигалка","Карманные часы","Географические карты","Видеопроигрыватель с кассетами","Книга по социологии","Компас","Консервы","Коробок спичек","Ящик с боеприпасами","Косметичка","Ледоруб и тросс","Лейка","Лук и стрелы","Молоток и гвозди","Музыкальная шкатулка","Набор для шитья","Набор инструментов","Набор кухонных пренадлежнастей","Настольные игры","Немецкая овчарка","Несколько чистых листов пергамента","Ноутбук","Шверйцарский нож","Пять пачек сигарет","Персидский кот","Пневматический пистолет","Презервативы","Пустая коробка","Радио","Три полных пакета туалетной бумаги","Семена съедобных растений","Мешок картофеля","5 стерильных шприцов","Сотовый телефон","Топор","Хозяйственное мыло","Бутылка спирта","Стопка журналов для взрослых","Телевизор","Три респератора","Флейта","Фонарик и запасные батарейки","Фотоаппарат","Ручной генератор электричества","Четыре рации","Надувная лодка","Инубатор с яйцами","Комплект метательных ножей"]
traits = []
specialConditions = []

def reshuffleCards():
    random.shuffle(professions)
    random.shuffle(healthStates)
    random.shuffle(bioFeatures)
    random.shuffle(hobbies)
    random.shuffle(phobias)
    random.shuffle(additionalInfos)
    random.shuffle(bagages)
    random.shuffle(traits)
    random.shuffle(specialConditions)

def createCharacter():
    if random.randint(0,1)==0:
        sex="Мужской"
    else:
        sex="Женский"
    age = random.randint(14,70)
    profession = professions.pop()
    if random.randint(0,100)>40:
        healthState = healthStates.pop()
    else:
        healthState = "Полностью здоров"
    
    print(sex,age,profession,healthState)

def characteristicsLength():
    print("Профессии: "+str(len(professions)))
    print("Состояния здоровья: "+str(len(healthStates)))
    print("Биологические особенности: "+str(len(bioFeatures)))
    print("Хобби: "+str(len(hobbies)))
    print("Фобии: "+str(len(phobias)))
    print("Дополнительные факты: "+str(len(additionalInfos)))
    print("Начальные предметы: "+str(len(bagages)))
    print("Черты характера: "+str(len(traits)))
    print("Специальные условия: "+str(len(specialConditions)))

reshuffleCards()

while True:
    print("Введите цифру, чтобы выбрать желаемую функцию:")
    print("1 - Вывести количество всех имеющихся характеристик")
    print("2 - Создать персонажа (Полученные характеристики будут удаленны, перезапустите программу чтобы добавить их вновь)")
    print("3 - Создать катастрофу")
    print("4 - Перемешать имеющиеся характеристики")
    print("5 - Закрыть программу")
    answer = input("Введите цифру: ")
    if answer == "1":
        characteristicsLength()
    elif answer == "2":
        createCharacter()
    elif answer == "4":
        reshuffleCards()
    elif answer == "5":
        break